#!/bin/bash

#1. Запрос исходной и целевой директории у пользователя


#2. Проверка существования исходной директории и целевой директории


#3. Запрос расширения файлов, которые нужно скопировать


#4. Запросить новое расширение для файлов.
#!/bin/bash

read -p "Enter branch name: "  new_file_extension

echo "You chose: $new_file_extension"

#5. Проверка, есть ли файлы с указанным расширением в исходной директории


#6. Копирование файлов с указанным расширением в целевую директорию


#7. Архивация исходных файлов.

